src/cf/Catalogs/ПрофилиГруппДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПрофилиГруппДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоставляемыхДанных</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйПрофильИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предустановленный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеРазрешены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяНижестоящие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПользователей</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбновлениеИнформационнойБазыУПОПереопределяемый/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

Процедура ПерейтиНаВерсию_1_0_4_3() Экспорт
	
	АдминистраторПодсистемыБоты = Справочники.ПрофилиГруппДоступа.АдминистраторПодсистемыБоты.ПолучитьОбъект();
	АдминистраторПодсистемыБоты.Роли.Очистить();
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрПодсистемыБоты");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеАдресаПубликацииИнформационнойБазыДляБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВложенностиКнопокМеню");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеИдентификаторовОбновленийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКомандБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеОткрытыхМенюПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеРегистрацииПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСообщенийПользователейБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияТиповСообщенийБотовМетодовИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеШаговВыполненияЗаданий");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПланаВидовХарактеристикПредопределенныеЗначения");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияПользователейСистем");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПользовательскихФункций");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеНастроекИнтеграции");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АдминистраторПодсистемыБоты);
	
КонецПроцедуры

Процедура ПерейтиНаВерсию_1_0_4_5() Экспорт
	
	АдминистраторПодсистемыБоты = Справочники.ПрофилиГруппДоступа.АдминистраторПодсистемыБоты.ПолучитьОбъект();
	АдминистраторПодсистемыБоты.Роли.Очистить();
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрПодсистемыБоты");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеАдресаПубликацииИнформационнойБазыДляБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВложенностиКнопокМеню");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеИдентификаторовОбновленийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКомандБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеОткрытыхМенюПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеРегистрацииПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСообщенийПользователейБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияТиповСообщенийБотовМетодовИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеШаговВыполненияЗаданий");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПланаВидовХарактеристикПредопределенныеЗначения");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияПользователейСистем");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПользовательскихФункций");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеНастроекИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеУчастниковВидеоЧатов");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АдминистраторПодсистемыБоты);
	
КонецПроцедуры

Процедура ПерейтиНаВерсию_1_0_4_6() Экспорт
	
	АдминистраторПодсистемыБоты = Справочники.ПрофилиГруппДоступа.АдминистраторПодсистемыБоты.ПолучитьОбъект();
	АдминистраторПодсистемыБоты.Роли.Очистить();
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрПодсистемыБоты");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеАдресаПубликацииИнформационнойБазыДляБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВложенностиКнопокМеню");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеИдентификаторовОбновленийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКомандБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеОткрытыхМенюПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеРегистрацииПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСообщенийПользователейБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияТиповСообщенийБотовМетодовИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеШаговВыполненияЗаданий");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПланаВидовХарактеристикПредопределенныеЗначения");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияПользователейСистем");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПользовательскихФункций");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеНастроекИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеУчастниковВидеоЧатов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрФормыНастроекПодсистемыБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКоличествоДнейХраненияВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКоличествоДнейХраненияСообщенийБотов");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АдминистраторПодсистемыБоты);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
